{"question": "Which bank is distant from Marina Centre?", "entities": {"Q6763797": {"mention": "Marina Centre", "label": "Marina Centre"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6763797\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"bank\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Which stadium is the furthest from Holland Village?", "entities": {"Q1106591": {"mention": "Holland Village", "label": "Holland Village"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q1106591\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"stadium\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which banks are near Mandai?", "entities": {"Q6747714": {"mention": "Mandai", "label": "Mandai"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6747714\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"bank\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which hospitals are distant from Yishun?", "entities": {"Q8053845": {"mention": "Yishun", "label": "Yishun"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q8053845\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Can you recommend universities that are close to Bishan?", "entities": {"Q3249777": {"mention": "Bishan", "label": "Bishan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3249777\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which memorial is the nearest to Geylang?", "entities": {"Q525295": {"mention": "Geylang", "label": "Geylang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q525295\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"memorial\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which colleges are near Changi Business Park?", "entities": {"Q1812824": {"mention": "Changi Business Park", "label": "Changi Business Park"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q1812824\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"college\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Can you tell me the hotel and road of Changi Bay?", "entities": {"Q5071983": {"mention": "Changi Bay", "label": "Changi Bay"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q5071983\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:tourism \"hotel\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:route \"road\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfWithin(?rwkt1, ?cwkt1) && geo:sfWithin(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "Which university is located the furthest from Larkin?", "entities": {"Q15120892": {"mention": "Larkin", "label": "Larkin"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q15120892\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which mosque is the farthest from Loyang?", "entities": {"Q6694491": {"mention": "Loyang", "label": "Loyang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6694491\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"mosque\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which hospitals are located within a 20km radius of Taman Universiti?", "entities": {"Q7680667": {"mention": "Taman Universiti", "label": "Taman Universiti"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680667\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Are there any prisons within a 20km distance of Outram?", "entities": {"Q15077913": {"mention": "Outram", "label": "Outram"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q15077913\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"prison\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "What is the proximity between HarbourFront and Crawford?", "entities": {"Q13882341": {"mention": "HarbourFront", "label": "HarbourFront"}, "Q24934656": {"mention": "Crawford", "label": "Crawford"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q13882341\" .\n    ?region2 osmkey:wikidata \"Q24934656\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
{"question": "Which park meets with Kovan?", "entities": {"Q6434834": {"mention": "Kovan", "label": "Kovan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6434834\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfIntersects(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "Can you recommend any hotels near Buangkok?", "entities": {"Q4982111": {"mention": "Buangkok", "label": "Buangkok"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4982111\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "What are the theatre and dam of Singapore River?", "entities": {"Q109583024": {"mention": "Singapore River", "label": "Singapore River"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q109583024\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:amenity \"theatre\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:waterway \"dam\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfIntersects(?rwkt1, ?cwkt1) && geo:sfIntersects(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "Can you tell me the distance between Ang Mo Kio and Bishan?", "entities": {"Q4761845": {"mention": "Ang Mo Kio", "label": "Ang Mo Kio"}, "Q3249777": {"mention": "Bishan", "label": "Bishan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q4761845\" .\n    ?region2 osmkey:wikidata \"Q3249777\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
{"question": "Is Changi Village close to Tampines?", "entities": {"Q5072003": {"mention": "Changi Village", "label": "Changi Village"}, "Q5110386": {"mention": "Tampines", "label": "Tampines"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q5072003\".\n    ?region2 osmkey:wikidata \"Q5110386\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
{"question": "Which universities are located within a 20km radius of Taman Desa Cemerlang?", "entities": {"Q12685647": {"mention": "Taman Desa Cemerlang", "label": "Taman Desa Cemerlang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q12685647\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Which mosque is the most distant from Taman Universiti?", "entities": {"Q7680667": {"mention": "Taman Universiti", "label": "Taman Universiti"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680667\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"mosque\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What lighthouses are close to Whampoa?", "entities": {"Q7990595": {"mention": "Whampoa", "label": "Whampoa"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7990595\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"lighthouse\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which stream is the farthest away from Austin Heights Water & Adventure Park?", "entities": {"Q65050186": {"mention": "Austin Heights Water & Adventure Park", "label": "Austin Heights Water & Adventure Park"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q65050186\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"stream\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which building is the closest to Crawford?", "entities": {"Q24934656": {"mention": "Crawford", "label": "Crawford"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q24934656\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"building\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which dams are distant from Taman Desa Cemerlang?", "entities": {"Q12685647": {"mention": "Taman Desa Cemerlang", "label": "Taman Desa Cemerlang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q12685647\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"dam\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "What is the distance from Changi Bay to Perling?", "entities": {"Q5071983": {"mention": "Changi Bay", "label": "Changi Bay"}, "Q13548361": {"mention": "Perling", "label": "Perling"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q5071983\" .\n    ?region2 osmkey:wikidata \"Q13548361\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
{"question": "Which bank is not far from Tampoi?", "entities": {"Q11152281": {"mention": "Tampoi", "label": "Tampoi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q11152281\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"bank\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Can you tell me which tower is the furthest from Bugis?", "entities": {"Q14489267": {"mention": "Bugis", "label": "Bugis"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q14489267\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"tower\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which hospitals are close to Woodlands?", "entities": {"Q5254438": {"mention": "Woodlands", "label": "Woodlands"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5254438\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Can you tell me which temple is closest to Serangoon North?", "entities": {"Q7452692": {"mention": "Serangoon North", "label": "Serangoon North"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7452692\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"temple\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What are the monuments that are within 20km of Serangoon North?", "entities": {"Q7452692": {"mention": "Serangoon North", "label": "Serangoon North"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7452692\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"monument\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Are there any memorials that are a short distance away from Bishan?", "entities": {"Q3249777": {"mention": "Bishan", "label": "Bishan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3249777\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"memorial\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Can you tell me which restaurants are near Bandar Putra Kulai?", "entities": {"Q4854413": {"mention": "Bandar Putra Kulai", "label": "Bandar Putra Kulai"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4854413\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"restaurant\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which university is the nearest to Permas Jaya?", "entities": {"Q7169303": {"mention": "Permas Jaya", "label": "Permas Jaya"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7169303\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What hotel is located next to Sentosa?", "entities": {"Q870844": {"mention": "Sentosa", "label": "Sentosa"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q870844\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfTouches(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "Which river is nearby Bukit Indah?", "entities": {"Q4986902": {"mention": "Bukit Indah", "label": "Bukit Indah"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4986902\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:water \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which church is the nearest to Senoko?", "entities": {"Q7450894": {"mention": "Senoko", "label": "Senoko"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7450894\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"church\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which monument is the most distant from Civic District?", "entities": {"Q5124297": {"mention": "Civic District", "label": "Civic District"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5124297\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"monument\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which cemetery is the furthest away from Bishan?", "entities": {"Q3249777": {"mention": "Bishan", "label": "Bishan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3249777\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which libraries are not close to Bras Basah?", "entities": {"Q25247920": {"mention": "Bras Basah", "label": "Bras Basah"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q25247920\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"library\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Can you tell me the universities that are within a 20km distance from Teluk Danga?", "entities": {"Q5215956": {"mention": "Teluk Danga", "label": "Teluk Danga"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5215956\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "What is the proximity between Pioneer and Alexandra?", "entities": {"Q16887503": {"mention": "Pioneer", "label": "Pioneer"}, "Q4720567": {"mention": "Alexandra", "label": "Alexandra"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q16887503\" .\n    ?region2 osmkey:wikidata \"Q4720567\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
