{"question": "Can you tell me the distance from Kallang to Seri Alam?", "entities": {"Q4216846": {"mention": "Kallang", "label": "Kallang"}, "Q4854416": {"mention": "Seri Alam", "label": "Seri Alam"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q4216846\" .\n    ?region2 osmkey:wikidata \"Q4854416\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
{"question": "What libraries are within a 20km distance from Kallang?", "entities": {"Q4216846": {"mention": "Kallang", "label": "Kallang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4216846\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"library\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me which canals are within 50km of Kampong Ubi?", "entities": {"Q7876505": {"mention": "Kampong Ubi", "label": "Kampong Ubi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7876505\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"canal\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "What museums are in the vicinity of Bendemeer?", "entities": {"Q23043489": {"mention": "Bendemeer", "label": "Bendemeer"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q23043489\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"museum\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Is Crawford near Singapore River?", "entities": {"Q109583024": {"mention": "Singapore River", "label": "Singapore River"}, "Q24934656": {"mention": "Crawford", "label": "Crawford"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q109583024\".\n    ?region2 osmkey:wikidata \"Q24934656\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
{"question": "What hospitals are near Downtown Core?", "entities": {"Q3810086": {"mention": "Downtown Core", "label": "Downtown Core"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3810086\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which park is the most distant from Larkin?", "entities": {"Q15120892": {"mention": "Larkin", "label": "Larkin"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q15120892\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which schools are located far from Toa Payoh?", "entities": {"Q2734905": {"mention": "Toa Payoh", "label": "Toa Payoh"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q2734905\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"school\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "What is the fort that is closest to Straits View?", "entities": {"Q24882679": {"mention": "Straits View", "label": "Straits View"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q24882679\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"fort\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What are the rivers near Choa Chu Kang?", "entities": {"Q1069101": {"mention": "Choa Chu Kang", "label": "Choa Chu Kang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q1069101\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which forest is the furthest from the Western Islands?", "entities": {"Q7987985": {"mention": "Western Islands", "label": "Western Islands"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7987985\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"forest\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which tower is nearby Bugis?", "entities": {"Q14489267": {"mention": "Bugis", "label": "Bugis"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q14489267\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"tower\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Can you recommend universities near Bugis?", "entities": {"Q14489267": {"mention": "Bugis", "label": "Bugis"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q14489267\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which prisons are located within 20km of Outram?", "entities": {"Q15077913": {"mention": "Outram", "label": "Outram"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q15077913\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"prison\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me which cemeteries are within a 50km radius of Kovan?", "entities": {"Q6434834": {"mention": "Kovan", "label": "Kovan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6434834\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which temples are located far from Loyang?", "entities": {"Q6694491": {"mention": "Loyang", "label": "Loyang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6694491\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"temple\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "What island exists in Katong?", "entities": {"Q6377786": {"mention": "Katong", "label": "Katong"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6377786\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"island\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfWithin(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "Which lighthouses are located within a 20km radius of Jurong Island?", "entities": {"Q14439130": {"mention": "Jurong Island", "label": "Jurong Island"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q14439130\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"lighthouse\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me the temple next to Taman Kempas?", "entities": {"Q6387036": {"mention": "Taman Kempas", "label": "Taman Kempas"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6387036\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"temple\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfTouches(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "Which hotels are located far from Punggol?", "entities": {"Q7260156": {"mention": "Punggol", "label": "Punggol"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7260156\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Can you show me the hotels that are within a 20km radius of Kampong Ubi?", "entities": {"Q7876505": {"mention": "Kampong Ubi", "label": "Kampong Ubi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7876505\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Are there any colleges that are less than 50km away from Kaki Bukit?", "entities": {"Q16934491": {"mention": "Kaki Bukit", "label": "Kaki Bukit"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q16934491\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"college\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "What are the canals that are within a 50km radius of Geylang?", "entities": {"Q525295": {"mention": "Geylang", "label": "Geylang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q525295\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"canal\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which tower is not far from Marina Centre?", "entities": {"Q6763797": {"mention": "Marina Centre", "label": "Marina Centre"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6763797\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"tower\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Can you tell me which restaurant is the furthest from Marine Parade?", "entities": {"Q6764201": {"mention": "Marine Parade", "label": "Marine Parade"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6764201\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"restaurant\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Are there any islands in Bukit Batok?", "entities": {"Q1906213": {"mention": "Bukit Batok", "label": "Bukit Batok"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q1906213\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"island\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfWithin(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "What is the memorial that borders Kaki Bukit?", "entities": {"Q16934491": {"mention": "Kaki Bukit", "label": "Kaki Bukit"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q16934491\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"memorial\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfTouches(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "What islands are within a 50km distance from Tuas South?", "entities": {"Q7850665": {"mention": "Tuas South", "label": "Tuas South"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7850665\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"island\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Is Joo Seng close to Potong Pasir?", "entities": {"Q7235101": {"mention": "Potong Pasir", "label": "Potong Pasir"}, "Q24947765": {"mention": "Joo Seng", "label": "Joo Seng"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q7235101\".\n    ?region2 osmkey:wikidata \"Q24947765\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
{"question": "Is Simei near Tampines?", "entities": {"Q5110386": {"mention": "Tampines", "label": "Tampines"}, "Q7517530": {"mention": "Simei", "label": "Simei"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q5110386\".\n    ?region2 osmkey:wikidata \"Q7517530\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
{"question": "Where can I find Kulai?", "entities": {"Q12492866": {"mention": "Kulai", "label": "Kulai"}}, "query": "PREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\u000b\u000bSELECT ?rwkt WHERE {\n    ?city osmkey:wikidata \"Q12492866\".\n    ?city geo:hasGeometry ?rwkt.\n    ?city rdf:type osm:node.\n}", "category": "A"}
{"question": "Which mosque is near Taman Universiti?", "entities": {"Q7680667": {"mention": "Taman Universiti", "label": "Taman Universiti"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680667\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"mosque\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "What are the towers near Taman Ungku Tun Aminah?", "entities": {"Q7680664": {"mention": "Taman Ungku Tun Aminah", "label": "Taman Ungku Tun Aminah"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680664\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"tower\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Can you tell me which colleges are within a 50km radius of Serangoon North?", "entities": {"Q7452692": {"mention": "Serangoon North", "label": "Serangoon North"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7452692\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"college\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Are there any cemeteries that are less than 50km away from Hougang?", "entities": {"Q10860944": {"mention": "Hougang", "label": "Hougang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10860944\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which buildings are near Orchard?", "entities": {"Q104535027": {"mention": "Orchard", "label": "Orchard"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q104535027\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"building\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Are there any cemeteries within 20km of Saleng?", "entities": {"Q7404283": {"mention": "Saleng", "label": "Saleng"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7404283\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "How long does it take to travel from Mutiara Rini to Bendemeer?", "entities": {"Q339576": {"mention": "Mutiara Rini", "label": "Mutiara Rini"}, "Q23043489": {"mention": "Bendemeer", "label": "Bendemeer"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q339576\" .\n    ?region2 osmkey:wikidata \"Q23043489\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
{"question": "What regions are within 50km of Permas Jaya?", "entities": {"Q7169303": {"mention": "Permas Jaya", "label": "Permas Jaya"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7169303\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"region\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "How many people live in Indonesia?", "entities": {"Q252": {"mention": "Indonesia", "label": "Indonesia"}}, "query": "PREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\u000bPREFIX osm: <https://www.openstreetmap.org/>\u000b\u000bSELECT DISTINCT ?population where {\n    ?s osmkey:wikidata \"Q252\".\n    ?s osmkey:population ?population.\n}", "category": "A"}
{"question": "Which streams are within a 20km radius of Joo Seng?", "entities": {"Q24947765": {"mention": "Joo Seng", "label": "Joo Seng"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q24947765\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"stream\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Which forest is the most distant from Kampong Ubi?", "entities": {"Q7876505": {"mention": "Kampong Ubi", "label": "Kampong Ubi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7876505\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"forest\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
