{"question": "What is the town and prison of Tuas?", "entities": {"Q7850658": {"mention": "Tuas", "label": "Tuas"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q7850658\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:place \"town\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:amenity \"prison\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfIntersects(?rwkt1, ?cwkt1) && geo:sfIntersects(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "Could you inform me which hotel is the closest to Alexandra?", "entities": {"Q4720567": {"mention": "Alexandra", "label": "Alexandra"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4720567\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which church is within a short distance from Pioneer?", "entities": {"Q16887503": {"mention": "Pioneer", "label": "Pioneer"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q16887503\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"church\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Can you tell me which hotel is next to Sentosa?", "entities": {"Q870844": {"mention": "Sentosa", "label": "Sentosa"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q870844\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfTouches(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "What parks are located within 20km of Sungei Kadut?", "entities": {"Q7640199": {"mention": "Sungei Kadut", "label": "Sungei Kadut"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7640199\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:natural \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Do you know which prison is in Loyang?", "entities": {"Q6694491": {"mention": "Loyang", "label": "Loyang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6694491\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"prison\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfCrosses(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "Which museum is the most remote from Jurong East?", "entities": {"Q1714023": {"mention": "Jurong East", "label": "Jurong East"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q1714023\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"museum\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What universities are in the vicinity of Tanjong Pagar?", "entities": {"Q868368": {"mention": "Tanjong Pagar", "label": "Tanjong Pagar"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q868368\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which hotels are at a distance from Bishan?", "entities": {"Q3249777": {"mention": "Bishan", "label": "Bishan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3249777\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "What are the regions that are within 20km of Johor Jaya?", "entities": {"Q7680631": {"mention": "Johor Jaya", "label": "Johor Jaya"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680631\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"region\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me the dams that are within 50km of Mutiara Rini?", "entities": {"Q339576": {"mention": "Mutiara Rini", "label": "Mutiara Rini"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q339576\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"dam\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "What is the school that is closest to Joo Seng?", "entities": {"Q24947765": {"mention": "Joo Seng", "label": "Joo Seng"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q24947765\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"school\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which universities are within 20km of Kaki Bukit?", "entities": {"Q16934491": {"mention": "Kaki Bukit", "label": "Kaki Bukit"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q16934491\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you list the rivers that are less than 50km away from Hougang?", "entities": {"Q10860944": {"mention": "Hougang", "label": "Hougang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10860944\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:water \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which museum is the furthest from Outram?", "entities": {"Q15077913": {"mention": "Outram", "label": "Outram"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q15077913\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"museum\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What parks are nearby Kallang?", "entities": {"Q4216846": {"mention": "Kallang", "label": "Kallang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4216846\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which beaches are located within a 20km radius of Kallang?", "entities": {"Q4216846": {"mention": "Kallang", "label": "Kallang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4216846\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:natural \"beach\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "What are the library and island located in Sengkang?", "entities": {"Q10861365": {"mention": "Sengkang", "label": "Sengkang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q10861365\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:amenity \"library\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:place \"island\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfWithin(?rwkt1, ?cwkt1) && geo:sfWithin(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "What are the villages that are less than 50km away from Horizon Hills?", "entities": {"Q17051282": {"mention": "Horizon Hills", "label": "Horizon Hills"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q17051282\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"village\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Can you give me a list of islands that are less than 50km away from Medini?", "entities": {"Q3304041": {"mention": "Medini", "label": "Medini"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3304041\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"island\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Can you tell me which prison is the farthest from Kampong Ubi?", "entities": {"Q7876505": {"mention": "Kampong Ubi", "label": "Kampong Ubi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7876505\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"prison\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which stadiums are located far from Tuas South?", "entities": {"Q7850665": {"mention": "Tuas South", "label": "Tuas South"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7850665\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"stadium\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Do you know which river shares borders with Teluk Danga?", "entities": {"Q5215956": {"mention": "Teluk Danga", "label": "Teluk Danga"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5215956\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:water \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfTouches(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "Which museum is the most distant from Outram?", "entities": {"Q15077913": {"mention": "Outram", "label": "Outram"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q15077913\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"museum\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which banks are within 20km of Potong Pasir?", "entities": {"Q7235101": {"mention": "Potong Pasir", "label": "Potong Pasir"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7235101\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"bank\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Which bank is the furthest from Hougang?", "entities": {"Q10860944": {"mention": "Hougang", "label": "Hougang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10860944\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"bank\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you provide information on hotels near Buangkok?", "entities": {"Q4982111": {"mention": "Buangkok", "label": "Buangkok"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4982111\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which cemeteries are located within a 20km radius of Simei?", "entities": {"Q7517530": {"mention": "Simei", "label": "Simei"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7517530\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me which rivers are near Marine Parade?", "entities": {"Q6764201": {"mention": "Marine Parade", "label": "Marine Parade"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6764201\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which prison is the closest to Ang Mo Kio?", "entities": {"Q4761845": {"mention": "Ang Mo Kio", "label": "Ang Mo Kio"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4761845\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"prison\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What are the theatres near Newton?", "entities": {"Q6453025": {"mention": "Newton", "label": "Newton"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6453025\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"theatre\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Can you tell me which cemeteries are within a 50km radius of Johor Jaya?", "entities": {"Q7680631": {"mention": "Johor Jaya", "label": "Johor Jaya"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680631\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Can you tell me which stadiums are far from Marine Parade?", "entities": {"Q6764201": {"mention": "Marine Parade", "label": "Marine Parade"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6764201\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"stadium\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Can you tell me what stream and stream of Bukit Panjang are?", "entities": {"Q2224065": {"mention": "Bukit Panjang", "label": "Bukit Panjang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q2224065\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:waterway \"stream\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:waterway \"stream\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfIntersects(?rwkt1, ?cwkt1) && geo:sfIntersects(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "Can you tell me the road and beach of Bedok?", "entities": {"Q4879339": {"mention": "Bedok", "label": "Bedok"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q4879339\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:route \"road\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:natural \"beach\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfIntersects(?rwkt1, ?cwkt1) && geo:sfIntersects(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "Which library is the most distant from Tuas South?", "entities": {"Q7850665": {"mention": "Tuas South", "label": "Tuas South"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7850665\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"library\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What are the cemeteries within a 50km distance from Hougang?", "entities": {"Q10860944": {"mention": "Hougang", "label": "Hougang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10860944\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Is Shenton Way near Shenton Way?", "entities": {"Q3299213": {"mention": "Shenton Way", "label": "Shenton Way"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q3299213\".\n    ?region2 osmkey:wikidata \"Q3299213\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
{"question": "Which canal is distant from Central Water Catchment?", "entities": {"Q25171659": {"mention": "Central Water Catchment", "label": "Central Water Catchment"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q25171659\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"canal\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Can you tell me which monuments are within a 50km radius of Sengkang?", "entities": {"Q10861365": {"mention": "Sengkang", "label": "Sengkang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10861365\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"monument\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Are Bishan and Kovan close to each other?", "entities": {"Q3249777": {"mention": "Bishan", "label": "Bishan"}, "Q6434834": {"mention": "Kovan", "label": "Kovan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q3249777\".\n    ?region2 osmkey:wikidata \"Q6434834\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
