{"question": "Which tower is nearby Bishan?", "entities": {"Q3249777": {"mention": "Bishan", "label": "Bishan"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3249777\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"tower\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which church is the furthest away from Queenstown?", "entities": {"Q9079137": {"mention": "Queenstown", "label": "Queenstown"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q9079137\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"church\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which river is close to Woodlands?", "entities": {"Q5254438": {"mention": "Woodlands", "label": "Woodlands"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5254438\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:water \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which river is not far from Woodlands?", "entities": {"Q5254438": {"mention": "Woodlands", "label": "Woodlands"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5254438\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "What cemeteries are there in Bukit Panjang?", "entities": {"Q2224065": {"mention": "Bukit Panjang", "label": "Bukit Panjang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q2224065\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfWithin(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "Can you tell me which cemeteries are within a 50km radius of the Southern Islands?", "entities": {"Q7570048": {"mention": "Southern Islands", "label": "Southern Islands"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7570048\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Could you inform me about the hotels near Kaki Bukit?", "entities": {"Q16934491": {"mention": "Kaki Bukit", "label": "Kaki Bukit"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q16934491\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "What are the names of the stadium and school in Shenton Way?", "entities": {"Q3299213": {"mention": "Shenton Way", "label": "Shenton Way"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q3299213\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:building \"stadium\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:building \"school\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfIntersects(?rwkt1, ?cwkt1) && geo:sfIntersects(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "Which forests are located far from Taman Ungku Tun Aminah?", "entities": {"Q7680664": {"mention": "Taman Ungku Tun Aminah", "label": "Taman Ungku Tun Aminah"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680664\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"forest\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Which memorial is the most distant from Bukit Panjang?", "entities": {"Q2224065": {"mention": "Bukit Panjang", "label": "Bukit Panjang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q2224065\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"memorial\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you recommend any beaches that are within a 50km distance from Seri Alam?", "entities": {"Q4854416": {"mention": "Seri Alam", "label": "Seri Alam"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4854416\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:natural \"beach\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "What schools are located near Joo Seng?", "entities": {"Q24947765": {"mention": "Joo Seng", "label": "Joo Seng"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q24947765\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"school\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Which park is the furthest from Marina South?", "entities": {"Q16056488": {"mention": "Marina South", "label": "Marina South"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q16056488\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which building is the furthest from Taman Universiti?", "entities": {"Q7680667": {"mention": "Taman Universiti", "label": "Taman Universiti"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680667\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"building\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which colleges are within a short distance from Toa Payoh?", "entities": {"Q2734905": {"mention": "Toa Payoh", "label": "Toa Payoh"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q2734905\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"college\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which church is the farthest from Queenstown?", "entities": {"Q9079137": {"mention": "Queenstown", "label": "Queenstown"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q9079137\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"church\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which prisons are within 20km of Straits View?", "entities": {"Q24882679": {"mention": "Straits View", "label": "Straits View"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q24882679\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"prison\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Which villages are situated within 20km of Central Water Catchment?", "entities": {"Q25171659": {"mention": "Central Water Catchment", "label": "Central Water Catchment"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q25171659\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"village\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you list the parks that are less than 50km away from Buangkok?", "entities": {"Q4982111": {"mention": "Buangkok", "label": "Buangkok"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4982111\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which tower is the most remote from Punggol?", "entities": {"Q7260156": {"mention": "Punggol", "label": "Punggol"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7260156\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"tower\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which islands are distant from Jurong Island?", "entities": {"Q14439130": {"mention": "Jurong Island", "label": "Jurong Island"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q14439130\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"island\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Which hospitals are nearby Taman Desa Cemerlang?", "entities": {"Q12685647": {"mention": "Taman Desa Cemerlang", "label": "Taman Desa Cemerlang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q12685647\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Can you provide me with a list of banks that are within 20km of Serangoon North?", "entities": {"Q7452692": {"mention": "Serangoon North", "label": "Serangoon North"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7452692\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"bank\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me which universities are near Pioneer?", "entities": {"Q16887503": {"mention": "Pioneer", "label": "Pioneer"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q16887503\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Can you list the universities that are within 20km of Taman Desa Cemerlang?", "entities": {"Q12685647": {"mention": "Taman Desa Cemerlang", "label": "Taman Desa Cemerlang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q12685647\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Are there rivers in Tuas?", "entities": {"Q7850658": {"mention": "Tuas", "label": "Tuas"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nASK WHERE {\n    ?region1 osmkey:wikidata \"Q7850658\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfIntersects(?cwkt1,?rwkt1))\n}", "category": "C"}
{"question": "Which universities are within a 20km radius of Bedok?", "entities": {"Q4879339": {"mention": "Bedok", "label": "Bedok"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4879339\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me if Yishun is close to Senoko?", "entities": {"Q8053845": {"mention": "Yishun", "label": "Yishun"}, "Q7450894": {"mention": "Senoko", "label": "Senoko"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q8053845\".\n    ?region2 osmkey:wikidata \"Q7450894\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
{"question": "Which hospital is the closest to Simei?", "entities": {"Q7517530": {"mention": "Simei", "label": "Simei"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7517530\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which monuments are within 20km of Thomson?", "entities": {"Q7795854": {"mention": "Thomson", "label": "Thomson"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7795854\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"monument\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me which villages are within a 20km radius of Taman Scientex?", "entities": {"Q7680647": {"mention": "Taman Scientex", "label": "Taman Scientex"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680647\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"village\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Which stadiums are not close to Downtown Core?", "entities": {"Q3810086": {"mention": "Downtown Core", "label": "Downtown Core"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3810086\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"stadium\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Can you recommend any hotels near Hougang?", "entities": {"Q10860944": {"mention": "Hougang", "label": "Hougang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10860944\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Are there any cemeteries within a 50km radius of Taman Kempas?", "entities": {"Q6387036": {"mention": "Taman Kempas", "label": "Taman Kempas"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6387036\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which university is the nearest one to Tampines?", "entities": {"Q5110386": {"mention": "Tampines", "label": "Tampines"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5110386\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What is the building that is closest to Sengkang?", "entities": {"Q10861365": {"mention": "Sengkang", "label": "Sengkang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10861365\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"building\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which university is the closest to Kampong Ubi?", "entities": {"Q7876505": {"mention": "Kampong Ubi", "label": "Kampong Ubi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7876505\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which park is the most distant from Taman Ungku Tun Aminah?", "entities": {"Q7680664": {"mention": "Taman Ungku Tun Aminah", "label": "Taman Ungku Tun Aminah"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680664\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Where are the cemetery and building of Sengkang situated?", "entities": {"Q10861365": {"mention": "Sengkang", "label": "Sengkang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q10861365\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:landuse \"cemetery\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:historic \"building\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfWithin(?rwkt1, ?cwkt1) && geo:sfWithin(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "What are the streams that are nearby Bugis?", "entities": {"Q14489267": {"mention": "Bugis", "label": "Bugis"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q14489267\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"stream\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which towers are within 50km of Tampoi?", "entities": {"Q11152281": {"mention": "Tampoi", "label": "Tampoi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q11152281\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:man_made \"tower\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
