{"question": "Can you tell me the prison and monument of Holland Village?", "entities": {"Q1106591": {"mention": "Holland Village", "label": "Holland Village"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class1 ?class2 WHERE {\n    ?region1 osmkey:wikidata \"Q1106591\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class1 osmkey:amenity \"prison\" .\n    ?class1 geo:hasGeometry ?cwkt1 .\n    ?class2 osmkey:historic \"monument\" .\n    ?class2 geo:hasGeometry ?cwkt2 .\n    FILTER(geo:sfIntersects(?rwkt1, ?cwkt1) && geo:sfIntersects(?rwkt1, ?cwkt2) )\n}", "category": "C"}
{"question": "Which hotel is the nearest to Woodlands?", "entities": {"Q5254438": {"mention": "Woodlands", "label": "Woodlands"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5254438\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which park is the furthest from Larkin?", "entities": {"Q15120892": {"mention": "Larkin", "label": "Larkin"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q15120892\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which museums are within a 50km radius of Bandar Dato Onn?", "entities": {"Q4854398": {"mention": "Bandar Dato Onn", "label": "Bandar Dato Onn"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4854398\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"museum\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which hospital is the farthest away from Shenton Way?", "entities": {"Q3299213": {"mention": "Shenton Way", "label": "Shenton Way"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3299213\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me the islands that are less than 50km away from Medini?", "entities": {"Q3304041": {"mention": "Medini", "label": "Medini"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q3304041\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"island\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Can you tell me the regions that are within 50km of Bras Basah?", "entities": {"Q25247920": {"mention": "Bras Basah", "label": "Bras Basah"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q25247920\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"region\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "What are the rivers that are within 20km of Puteri Harbour?", "entities": {"Q12701480": {"mention": "Puteri Harbour", "label": "Puteri Harbour"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q12701480\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:waterway \"river\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me which prisons are within a 20km radius of Gerbang Nusajaya?", "entities": {"Q24932723": {"mention": "Gerbang Nusajaya", "label": "Gerbang Nusajaya"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q24932723\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"prison\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Can you tell me the distance between Changi Bay and Perling?", "entities": {"Q5071983": {"mention": "Changi Bay", "label": "Changi Bay"}, "Q13548361": {"mention": "Perling", "label": "Perling"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q5071983\" .\n    ?region2 osmkey:wikidata \"Q13548361\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
{"question": "Which cemetery is the most distant from Crawford?", "entities": {"Q24934656": {"mention": "Crawford", "label": "Crawford"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q24934656\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:landuse \"cemetery\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "What is the distance between Civic District and Bugis?", "entities": {"Q5124297": {"mention": "Civic District", "label": "Civic District"}, "Q14489267": {"mention": "Bugis", "label": "Bugis"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q5124297\" .\n    ?region2 osmkey:wikidata \"Q14489267\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
{"question": "What parks are close to Seri Alam?", "entities": {"Q4854416": {"mention": "Seri Alam", "label": "Seri Alam"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4854416\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"park\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "What are the buildings that are within 20km of Hougang?", "entities": {"Q10860944": {"mention": "Hougang", "label": "Hougang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10860944\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"building\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Which villages are located less than 50km from Potong Pasir?", "entities": {"Q7235101": {"mention": "Potong Pasir", "label": "Potong Pasir"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7235101\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:place \"village\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which hospitals are located far from Johor Jaya?", "entities": {"Q7680631": {"mention": "Johor Jaya", "label": "Johor Jaya"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7680631\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Is Kallang near Serangoon?", "entities": {"Q10861231": {"mention": "Serangoon", "label": "Serangoon"}, "Q4216846": {"mention": "Kallang", "label": "Kallang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q10861231\".\n    ?region2 osmkey:wikidata \"Q4216846\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
{"question": "Which prison is located the furthest from Kampong Ubi?", "entities": {"Q7876505": {"mention": "Kampong Ubi", "label": "Kampong Ubi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7876505\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"prison\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which mosque is the most remote from Geylang?", "entities": {"Q525295": {"mention": "Geylang", "label": "Geylang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q525295\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"mosque\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Can you tell me which hotel is the furthest from Bukit Indah?", "entities": {"Q4986902": {"mention": "Bukit Indah", "label": "Bukit Indah"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4986902\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY DESC(?distance)\nLIMIT 1", "category": "C"}
{"question": "How far is Queenstown from Sengkang?", "entities": {"Q9079137": {"mention": "Queenstown", "label": "Queenstown"}, "Q10861365": {"mention": "Sengkang", "label": "Sengkang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT (geof:distance(?rwkt1, ?rwkt2, uom:metre) AS ?distance) {    \n    ?region1 osmkey:wikidata \"Q9079137\" .\n    ?region2 osmkey:wikidata \"Q10861365\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?region2 geo:hasGeometry ?rwkt2 .\n}", "category": "B"}
{"question": "Can you tell me which school is closest to Sungei Kadut?", "entities": {"Q7640199": {"mention": "Sungei Kadut", "label": "Sungei Kadut"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7640199\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"school\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which hotels are located near Seletar?", "entities": {"Q7447926": {"mention": "Seletar", "label": "Seletar"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7447926\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Can you tell me which museums are in Loyang?", "entities": {"Q6694491": {"mention": "Loyang", "label": "Loyang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6694491\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"museum\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geo:sfContains(?rwkt1, ?cwkt1))\n}", "category": "C"}
{"question": "Which castles are distant from Serangoon North?", "entities": {"Q7452692": {"mention": "Serangoon North", "label": "Serangoon North"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7452692\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"castle\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Are there any stadiums near Bandar Baru Uda?", "entities": {"Q4854387": {"mention": "Bandar Baru Uda", "label": "Bandar Baru Uda"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4854387\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"stadium\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Can you tell me which schools are near Permas Jaya?", "entities": {"Q7169303": {"mention": "Permas Jaya", "label": "Permas Jaya"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7169303\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"school\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which stadiums are located far from Bendemeer?", "entities": {"Q23043489": {"mention": "Bendemeer", "label": "Bendemeer"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q23043489\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:leisure \"stadium\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "Which hotels are located far from Austin Heights Water & Adventure Park?", "entities": {"Q65050186": {"mention": "Austin Heights Water & Adventure Park", "label": "Austin Heights Water & Adventure Park"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q65050186\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
{"question": "What are the beaches near Hougang?", "entities": {"Q10860944": {"mention": "Hougang", "label": "Hougang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q10860944\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:natural \"beach\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Can you tell me which castles are within 20km of Serangoon Gardens?", "entities": {"Q7452691": {"mention": "Serangoon Gardens", "label": "Serangoon Gardens"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q7452691\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:historic \"castle\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Is the distance between Singapore River and Crawford far?", "entities": {"Q109583024": {"mention": "Singapore River", "label": "Singapore River"}, "Q24934656": {"mention": "Crawford", "label": "Crawford"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nASK {\n    ?region1 osmkey:wikidata \"Q109583024\".\n    ?region2 osmkey:wikidata \"Q24934656\".\n    ?region1 geo:hasGeometry ?rwkt1.\n    ?region2 geo:hasGeometry ?rwkt2.\n    FILTER(geof:distance(?rwkt1,?rwkt2, uom:metre) < 5000)\n}", "category": "B"}
{"question": "What hotels are nearby Kallang?", "entities": {"Q4216846": {"mention": "Kallang", "label": "Kallang"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4216846\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which museums are nearby Marina Centre?", "entities": {"Q6763797": {"mention": "Marina Centre", "label": "Marina Centre"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q6763797\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:tourism \"museum\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 5000)\n}", "category": "C"}
{"question": "Which university is the nearest to Sunway Iskandar?", "entities": {"Q94669768": {"mention": "Sunway Iskandar", "label": "Sunway Iskandar"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q94669768\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"university\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which mosque is the nearest to Sentosa?", "entities": {"Q870844": {"mention": "Sentosa", "label": "Sentosa"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q870844\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"mosque\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    BIND(geof:distance(?rwkt1,?cwkt1,uom:metre) AS ?distance)\n}\nORDER BY ASC(?distance)\nLIMIT 1", "category": "C"}
{"question": "Which hotels are in the vicinity of Teluk Danga?", "entities": {"Q5215956": {"mention": "Teluk Danga", "label": "Teluk Danga"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5215956\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hotel\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "What restaurants are close to Pioneer?", "entities": {"Q16887503": {"mention": "Pioneer", "label": "Pioneer"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q16887503\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"restaurant\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 5000)\n}", "category": "C"}
{"question": "Can you show me the colleges that are within 20km of Clementi?", "entities": {"Q4259064": {"mention": "Clementi", "label": "Clementi"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q4259064\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"college\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) <= 20000)\n}", "category": "C"}
{"question": "Which hospitals are less than 50km from Tampines?", "entities": {"Q5110386": {"mention": "Tampines", "label": "Tampines"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q5110386\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:building \"hospital\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) < 50000)\n}", "category": "C"}
{"question": "Which theatre is located far from Novena?", "entities": {"Q985660": {"mention": "Novena", "label": "Novena"}}, "query": "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\nPREFIX osmkey: <https://www.openstreetmap.org/wiki/Key:>\nPREFIX osm: <https://www.openstreetmap.org/>\nPREFIX geo: <http://www.opengis.net/ont/geosparql#>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/>\n\nSELECT DISTINCT ?class WHERE {\n    ?region1 osmkey:wikidata \"Q985660\" .\n    ?region1 geo:hasGeometry ?rwkt1 .\n    ?class osmkey:amenity \"theatre\" .\n    ?class geo:hasGeometry ?cwkt1 .\n    FILTER(geof:distance(?rwkt1,?cwkt1,uom:metre) > 5000)\n}", "category": "C"}
